## Plan Result (sbox-hmcts_hub_sbox-acme)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 9 to add, 0 to change, 8 to destroy.</code></pre>

* Create
  * azurerm_application_insights.appinsight
  * azurerm_key_vault.kv
  * azurerm_resource_group.rg
  * azurerm_role_assignment.Reader
  * azurerm_role_assignment.kvaccess
  * azurerm_role_assignment.kvgroupaccess
  * azurerm_service_plan.asp
  * azurerm_storage_account.stg
  * azurerm_windows_function_app.funcapp
* Delete
  * module.acme.azuread_group_member.dnszonecontributor
  * module.acme.azurerm_application_insights.appinsight
  * module.acme.azurerm_key_vault.kv
  * module.acme.azurerm_resource_group.rg
  * module.acme.azurerm_role_assignment.kvgroupaccess
  * module.acme.azurerm_service_plan.asp
  * module.acme.azurerm_storage_account.stg
  * module.acme.azurerm_windows_function_app.funcapp




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.appinsight will be created
  + resource "azurerm_application_insights" "appinsight" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + name                                  = "hub-sbox"
      + resource_group_name                   = "hub-sbox-rg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise-acme"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
    }

  # azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = true
      + enabled_for_deployment        = true
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "acmehmctshubsbox"
      + public_network_access_enabled = true
      + resource_group_name           = "hub-sbox-rg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise-acme"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                     = (known after apply)

      + network_acls {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "hub-sbox-rg"
      + tags     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise-acme"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
    }

  # azurerm_role_assignment.Reader will be created
  + resource "azurerm_role_assignment" "Reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.kvaccess will be created
  + resource "azurerm_role_assignment" "kvaccess" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.kvgroupaccess will be created
  + resource "azurerm_role_assignment" "kvgroupaccess" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_service_plan.asp will be created
  + resource "azurerm_service_plan" "asp" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "uksouth"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "hub-sbox-asp"
      + os_type                      = "Windows"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "hub-sbox-rg"
      + sku_name                     = "Y1"
      + tags                         = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise-acme"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + worker_count                 = (known after apply)
    }

  # azurerm_storage_account.stg will be created
  + resource "azurerm_storage_account" "stg" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "ZRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = false
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "uksouth"
      + min_tls_version                   = "TLS1_2"
      + name                              = "acmehmctshubsbox"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "hub-sbox-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise-acme"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }

      + blob_properties {
          + change_feed_enabled           = (known after apply)
          + change_feed_retention_in_days = (known after apply)
          + default_service_version       = (known after apply)
          + last_access_time_enabled      = (known after apply)
          + versioning_enabled            = (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

  # azurerm_windows_function_app.funcapp will be created
  + resource "azurerm_windows_function_app" "funcapp" {
      + app_settings                      = (known after apply)
      + builtin_logging_enabled           = true
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Optional"
      + content_share_force_disabled      = false
      + custom_domain_verification_id     = (sensitive value)
      + daily_memory_time_quota           = 0
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + functions_extension_version       = "~4"
      + https_only                        = (known after apply)
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "uksouth"
      + name                              = "acmehmctshubsbox"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "hub-sbox-rg"
      + service_plan_id                   = (known after apply)
      + site_credential                   = (known after apply)
      + storage_account_access_key        = (sensitive value)
      + storage_account_name              = "acmehmctshubsbox"
      + storage_uses_managed_identity     = false
      + tags                              = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise-acme"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }

      + auth_settings {
          + allowed_external_redirect_urls = (known after apply)
          + default_provider               = "AzureActiveDirectory"
          + enabled                        = true
          + runtime_version                = (known after apply)
          + token_refresh_extension_hours  = 72
          + token_store_enabled            = false
          + unauthenticated_client_action  = "RedirectToLoginPage"

          + active_directory {
              + client_id = "af60f2dd-6262-4a3c-ad35-0cc2d8bc820f"
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                              = (known after apply)
          + app_scale_limit                        = (known after apply)
          + application_insights_connection_string = (sensitive value)
          + default_documents                      = (known after apply)
          + detailed_error_logging_enabled         = (known after apply)
          + elastic_instance_minimum               = (known after apply)
          + ftps_state                             = "Disabled"
          + health_check_eviction_time_in_min      = (known after apply)
          + http2_enabled                          = false
          + ip_restriction                         = (known after apply)
          + load_balancing_mode                    = "LeastRequests"
          + managed_pipeline_mode                  = "Integrated"
          + minimum_tls_version                    = "1.2"
          + pre_warmed_instance_count              = (known after apply)
          + remote_debugging_enabled               = false
          + remote_debugging_version               = (known after apply)
          + scm_ip_restriction                     = (known after apply)
          + scm_minimum_tls_version                = "1.2"
          + scm_type                               = (known after apply)
          + scm_use_main_ip_restriction            = false
          + use_32_bit_worker                      = true
          + vnet_route_all_enabled                 = false
          + websockets_enabled                     = false
          + windows_fx_version                     = (known after apply)
          + worker_count                           = (known after apply)
        }
    }

  # module.acme.azuread_group_member.dnszonecontributor will be destroyed
  # (because azuread_group_member.dnszonecontributor is not in configuration)
  - resource "azuread_group_member" "dnszonecontributor" {
      - group_object_id  = "6c2d130e-ba66-408a-bdf9-f426a9730923" -> null
      - id               = "6c2d130e-ba66-408a-bdf9-f426a9730923/member/5642fa4a-c569-433d-8d9f-d2c988815b6e" -> null
      - member_object_id = "5642fa4a-c569-433d-8d9f-d2c988815b6e" -> null

      - timeouts {}
    }

  # module.acme.azurerm_application_insights.appinsight will be destroyed
  # (because azurerm_application_insights.appinsight is not in configuration)
  - resource "azurerm_application_insights" "appinsight" {
      - app_id                                = "3f46329a-7009-465b-b3b9-6157afad1384" -> null
      - application_type                      = "web" -> null
      - connection_string                     = (sensitive value)
      - daily_data_cap_in_gb                  = 100 -> null
      - daily_data_cap_notifications_disabled = false -> null
      - disable_ip_masking                    = false -> null
      - force_customer_storage_for_profiler   = false -> null
      - id                                    = "/subscriptions/681c247c-c695-4b87-b018-8756a0b8b19d/resourceGroups/hub-sbox-rg/providers/microsoft.insights/components/hub-sbox" -> null
      - instrumentation_key                   = (sensitive value)
      - internet_ingestion_enabled            = true -> null
      - internet_query_enabled                = true -> null
      - local_authentication_disabled         = false -> null
      - location                              = "uksouth" -> null
      - name                                  = "hub-sbox" -> null
      - resource_group_name                   = "hub-sbox-rg" -> null
      - retention_in_days                     = 90 -> null
      - sampling_percentage                   = 100 -> null
      - tags                                  = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/ops-bootstrap"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
        } -> null

      - timeouts {}
    }

  # module.acme.azurerm_key_vault.kv will be destroyed
  # (because azurerm_key_vault.kv is not in configuration)
  - resource "azurerm_key_vault" "kv" {
      - access_policy                   = [] -> null
      - enable_rbac_authorization       = true -> null
      - enabled_for_deployment          = false -> null
      - enabled_for_disk_encryption     = false -> null
      - enabled_for_template_deployment = false -> null
      - id                              = "/subscriptions/681c247c-c695-4b87-b018-8756a0b8b19d/resourceGroups/hub-sbox-rg/providers/Microsoft.KeyVault/vaults/acmehmctshubsbox" -> null
      - location                        = "uksouth" -> null
      - name                            = "acmehmctshubsbox" -> null
      - public_network_access_enabled   = true -> null
      - purge_protection_enabled        = false -> null
      - resource_group_name             = "hub-sbox-rg" -> null
      - sku_name                        = "standard" -> null
      - soft_delete_retention_days      = 90 -> null
      - tags                            = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/ops-bootstrap"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
        } -> null
      - tenant_id                       = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
      - vault_uri                       = "https://acmehmctshubsbox.vault.azure.net/" -> null

      - network_acls {
          - bypass                     = "AzureServices" -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }

      - timeouts {}
    }

  # module.acme.azurerm_resource_group.rg will be destroyed
  # (because azurerm_resource_group.rg is not in configuration)
  - resource "azurerm_resource_group" "rg" {
      - id       = "/subscriptions/681c247c-c695-4b87-b018-8756a0b8b19d/resourceGroups/hub-sbox-rg" -> null
      - location = "uksouth" -> null
      - name     = "hub-sbox-rg" -> null
      - tags     = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/ops-bootstrap"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
        } -> null

      - timeouts {}
    }

  # module.acme.azurerm_role_assignment.kvgroupaccess will be destroyed
  # (because azurerm_role_assignment.kvgroupaccess is not in configuration)
  - resource "azurerm_role_assignment" "kvgroupaccess" {
      - id                   = "/subscriptions/681c247c-c695-4b87-b018-8756a0b8b19d/resourceGroups/hub-sbox-rg/providers/Microsoft.KeyVault/vaults/acmehmctshubsbox/providers/Microsoft.Authorization/roleAssignments/811dd5ed-8acd-3096-6dcf-b01d5609b9fa" -> null
      - name                 = "811dd5ed-8acd-3096-6dcf-b01d5609b9fa" -> null
      - principal_id         = "e7ea2042-4ced-45dd-8ae3-e051c6551789" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/681c247c-c695-4b87-b018-8756a0b8b19d/providers/Microsoft.Authorization/roleDefinitions/00482a5a-887f-4fb3-b363-3b7fe8e74483" -> null
      - role_definition_name = "Key Vault Administrator" -> null
      - scope                = "/subscriptions/681c247c-c695-4b87-b018-8756a0b8b19d/resourceGroups/hub-sbox-rg/providers/Microsoft.KeyVault/vaults/acmehmctshubsbox" -> null

      - timeouts {}
    }

  # module.acme.azurerm_service_plan.asp will be destroyed
  # (because azurerm_service_plan.asp is not in configuration)
  - resource "azurerm_service_plan" "asp" {
      - id                           = "/subscriptions/681c247c-c695-4b87-b018-8756a0b8b19d/resourceGroups/hub-sbox-rg/providers/Microsoft.Web/serverfarms/hub-sbox-asp" -> null
      - kind                         = "functionapp" -> null
      - location                     = "uksouth" -> null
      - maximum_elastic_worker_count = 1 -> null
      - name                         = "hub-sbox-asp" -> null
      - os_type                      = "Windows" -> null
      - per_site_scaling_enabled     = false -> null
      - reserved                     = false -> null
      - resource_group_name          = "hub-sbox-rg" -> null
      - sku_name                     = "Y1" -> null
      - tags                         = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/ops-bootstrap"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
        } -> null
      - worker_count                 = 0 -> null
      - zone_balancing_enabled       = false -> null

      - timeouts {}
    }

  # module.acme.azurerm_storage_account.stg will be destroyed
  # (because azurerm_storage_account.stg is not in configuration)
  - resource "azurerm_storage_account" "stg" {
      - access_tier                       = "Hot" -> null
      - account_kind                      = "StorageV2" -> null
      - account_replication_type          = "ZRS" -> null
      - account_tier                      = "Standard" -> null
      - allow_nested_items_to_be_public   = false -> null
      - default_to_oauth_authentication   = false -> null
      - enable_https_traffic_only         = true -> null
      - id                                = "/subscriptions/681c247c-c695-4b87-b018-8756a0b8b19d/resourceGroups/hub-sbox-rg/providers/Microsoft.Storage/storageAccounts/acmehmctshubsbox" -> null
      - infrastructure_encryption_enabled = false -> null
      - is_hns_enabled                    = false -> null
      - location                          = "uksouth" -> null
      - min_tls_version                   = "TLS1_0" -> null
      - name                              = "acmehmctshubsbox" -> null
      - nfsv3_enabled                     = false -> null
      - primary_access_key                = (sensitive value)
      - primary_blob_connection_string    = (sensitive value)
      - primary_blob_endpoint             = "https://acmehmctshubsbox.blob.core.windows.net/" -> null
      - primary_blob_host                 = "acmehmctshubsbox.blob.core.windows.net" -> null
      - primary_connection_string         = (sensitive value)
      - primary_dfs_endpoint              = "https://acmehmctshubsbox.dfs.core.windows.net/" -> null
      - primary_dfs_host                  = "acmehmctshubsbox.dfs.core.windows.net" -> null
      - primary_file_endpoint             = "https://acmehmctshubsbox.file.core.windows.net/" -> null
      - primary_file_host                 = "acmehmctshubsbox.file.core.windows.net" -> null
      - primary_location                  = "uksouth" -> null
      - primary_queue_endpoint            = "https://acmehmctshubsbox.queue.core.windows.net/" -> null
      - primary_queue_host                = "acmehmctshubsbox.queue.core.windows.net" -> null
      - primary_table_endpoint            = "https://acmehmctshubsbox.table.core.windows.net/" -> null
      - primary_table_host                = "acmehmctshubsbox.table.core.windows.net" -> null
      - primary_web_endpoint              = "https://acmehmctshubsbox.z33.web.core.windows.net/" -> null
      - primary_web_host                  = "acmehmctshubsbox.z33.web.core.windows.net" -> null
      - public_network_access_enabled     = true -> null
      - queue_encryption_key_type         = "Service" -> null
      - resource_group_name               = "hub-sbox-rg" -> null
      - secondary_access_key              = (sensitive value)
      - secondary_connection_string       = (sensitive value)
      - shared_access_key_enabled         = true -> null
      - table_encryption_key_type         = "Service" -> null
      - tags                              = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/ops-bootstrap"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
        } -> null

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
        }

      - network_rules {
          - bypass                     = [
              - "AzureServices",
            ] -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }

      - queue_properties {

          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }

          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }

          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {

          - retention_policy {
              - days = 7 -> null
            }
        }

      - timeouts {}
    }

  # module.acme.azurerm_windows_function_app.funcapp will be destroyed
  # (because azurerm_windows_function_app.funcapp is not in configuration)
  - resource "azurerm_windows_function_app" "funcapp" {
      - app_settings                      = {
          - "Acmebot:AzureDns:SubscriptionId"            = "ed302caf-ec27-4c64-a05e-85731c3ce90e"
          - "Acmebot:Contacts"                           = "cnp-acme-owner@hmcts.net"
          - "Acmebot:Endpoint"                           = "https://acme-v02.api.letsencrypt.org/"
          - "Acmebot:Environment"                        = "AzureCloud"
          - "Acmebot:VaultBaseUrl"                       = "https://acmehmctshubsbox.vault.azure.net/"
          - "ApplicationInsightsAgent_EXTENSION_VERSION" = "~2"
          - "WEBSITE_RUN_FROM_PACKAGE"                   = "https://shibayan.blob.core.windows.net/azure-keyvault-letsencrypt/v3/latest.zip"
        } -> null
      - builtin_logging_enabled           = true -> null
      - client_certificate_enabled        = false -> null
      - client_certificate_mode           = "Required" -> null
      - content_share_force_disabled      = false -> null
      - custom_domain_verification_id     = (sensitive value)
      - daily_memory_time_quota           = 0 -> null
      - default_hostname                  = "acmehmctshubsbox.azurewebsites.net" -> null
      - enabled                           = true -> null
      - functions_extension_version       = "~3" -> null
      - https_only                        = false -> null
      - id                                = "/subscriptions/681c247c-c695-4b87-b018-8756a0b8b19d/resourceGroups/hub-sbox-rg/providers/Microsoft.Web/sites/acmehmctshubsbox" -> null
      - key_vault_reference_identity_id   = "SystemAssigned" -> null
      - kind                              = "functionapp" -> null
      - location                          = "uksouth" -> null
      - name                              = "acmehmctshubsbox" -> null
      - outbound_ip_address_list          = [
          - "51.143.228.209",
          - "51.143.229.5",
          - "51.143.229.29",
          - "51.143.229.38",
          - "51.143.229.71",
          - "51.143.229.203",
          - "51.104.28.72",
        ] -> null
      - outbound_ip_addresses             = "51.143.228.209,51.143.229.5,51.143.229.29,51.143.229.38,51.143.229.71,51.143.229.203,51.104.28.72" -> null
      - possible_outbound_ip_address_list = [
          - "51.143.228.209",
          - "51.143.229.5",
          - "51.143.229.29",
          - "51.143.229.38",
          - "51.143.229.71",
          - "51.143.229.203",
          - "51.143.229.226",
          - "51.143.230.17",
          - "51.143.230.55",
          - "51.143.230.73",
          - "51.143.225.143",
          - "51.143.230.106",
          - "51.143.230.114",
          - "51.143.230.140",
          - "51.143.230.218",
          - "51.143.230.228",
          - "51.143.230.242",
          - "51.143.230.244",
          - "51.143.230.253",
          - "51.143.231.30",
          - "51.143.231.50",
          - "51.143.231.144",
          - "51.143.231.159",
          - "51.143.231.231",
          - "20.77.184.4",
          - "20.49.137.113",
          - "20.77.184.11",
          - "20.77.184.28",
          - "20.77.184.51",
          - "20.77.184.57",
          - "51.104.28.72",
        ] -> null
      - possible_outbound_ip_addresses    = "51.143.228.209,51.143.229.5,51.143.229.29,51.143.229.38,51.143.229.71,51.143.229.203,51.143.229.226,51.143.230.17,51.143.230.55,51.143.230.73,51.143.225.143,51.143.230.106,51.143.230.114,51.143.230.140,51.143.230.218,51.143.230.228,51.143.230.242,51.143.230.244,51.143.230.253,51.143.231.30,51.143.231.50,51.143.231.144,51.143.231.159,51.143.231.231,20.77.184.4,20.49.137.113,20.77.184.11,20.77.184.28,20.77.184.51,20.77.184.57,51.104.28.72" -> null
      - resource_group_name               = "hub-sbox-rg" -> null
      - service_plan_id                   = "/subscriptions/681c247c-c695-4b87-b018-8756a0b8b19d/resourceGroups/hub-sbox-rg/providers/Microsoft.Web/serverfarms/hub-sbox-asp" -> null
      - site_credential                   = [
          - {
              - name     = "$acmehmctshubsbox"
              - password = "tfuTXHl3TlSzJJyAaydb3kpF9oZLpBcjL6s7BB6iGDxo0l6osigGY2bSh0Nd"
            },
        ] -> null
      - storage_account_access_key        = (sensitive value)
      - storage_account_name              = "acmehmctshubsbox" -> null
      - storage_uses_managed_identity     = false -> null
      - tags                              = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/ops-bootstrap"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
        } -> null

      - auth_settings {
          - additional_login_parameters    = {} -> null
          - allowed_external_redirect_urls = [] -> null
          - default_provider               = "AzureActiveDirectory" -> null
          - enabled                        = true -> null
          - token_refresh_extension_hours  = 72 -> null
          - token_store_enabled            = false -> null
          - unauthenticated_client_action  = "RedirectToLoginPage" -> null

          - active_directory {
              - allowed_audiences = [] -> null
              - client_id         = "af60f2dd-6262-4a3c-ad35-0cc2d8bc820f" -> null
            }
        }

      - identity {
          - identity_ids = [] -> null
          - principal_id = "5642fa4a-c569-433d-8d9f-d2c988815b6e" -> null
          - tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
          - type         = "SystemAssigned" -> null
        }

      - site_config {
          - always_on                              = false -> null
          - app_scale_limit                        = 200 -> null
          - application_insights_connection_string = (sensitive value)
          - application_insights_key               = (sensitive value)
          - default_documents                      = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
            ] -> null
          - detailed_error_logging_enabled         = false -> null
          - elastic_instance_minimum               = 0 -> null
          - ftps_state                             = "AllAllowed" -> null
          - health_check_eviction_time_in_min      = 0 -> null
          - http2_enabled                          = false -> null
          - ip_restriction                         = [] -> null
          - load_balancing_mode                    = "LeastRequests" -> null
          - managed_pipeline_mode                  = "Integrated" -> null
          - minimum_tls_version                    = "1.2" -> null
          - pre_warmed_instance_count              = 0 -> null
          - remote_debugging_enabled               = false -> null
          - runtime_scale_monitoring_enabled       = false -> null
          - scm_ip_restriction                     = [] -> null
          - scm_minimum_tls_version                = "1.0" -> null
          - scm_type                               = "None" -> null
          - scm_use_main_ip_restriction            = false -> null
          - use_32_bit_worker                      = true -> null
          - vnet_route_all_enabled                 = false -> null
          - websockets_enabled                     = false -> null
          - worker_count                           = 1 -> null
        }

      - timeouts {}
    }

Plan: 9 to add, 0 to change, 8 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":3,"Program":"tfcmt","SHA1":"","Target":"sbox-hmcts_hub_sbox-acme","Vars":{}} -->